# ViewSet Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSet Class
Members See Also
---
A set that contains views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ViewSet : APIObject, IEnumerable
```

Visual Basic
---
```text
Public Class ViewSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class ViewSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..ViewSet
# See Also
ViewSet Members
Autodesk.Revit.DB Namespace